### Expressions :
***

`\d`                         Any numeric digit from `0` to `9`.
                           
`\D`                         Matches any character which is not a decimal digit. 
                           This is the opposite of `\d`.
                           
`\w`                         Any letter, numeric digit, or the underscore
                           character.  (Think of this as matching
                           "word" characters.)
                           
`\W`                         Any character that is not a letter,
                           numeric digit, or the underscore character.
                           
`\s`                         Any space, tab, or newline character.  (
                           Think of this as matching white-space
                           characters.)
                           
`\S`                         Any character that is not a space, tab,
                           or newline.
***

In [1]:
import re
import pandas as pd

In [ ]:
# https://regex101.com/
# regex bir metnin içerisinde isteddiğimiz değerleri çıkarmak için kullanılır.

In [2]:
text = "A78L41K"

In [4]:
num = re.search("\d\d",text)
num

In [5]:
num.group(0)

'78'

In [6]:
text = "8PM19MIN"

In [7]:
nondigi=re.search('\D',text)
print(nondigi.group())

P

In [12]:
text = 'My phone number is 555 666 7777'

In [21]:
telno=re.search('\d\d\d \d\d\d \d\d\d\d',text)
print(telno.group())

555 666 7777

In [23]:
text = 'My phone number is 415-555-1212'

In [24]:
telno=re.search('\d\d\d-\d\d\d-\d\d\d\d',text)
print(telno.group(0))

415-555-1212

In [25]:
telno=re.search('(\d\d\d)-(\d\d\d)-(\d\d\d\d)',text) # 3 grup haline getirdik.
print(telno.group(3))

1212

In [26]:
telno = re.search("\d"*3 + "-" + "\d"*3 + "-" + "\d"*4, text)
print(telno.group())

415-555-1212

In [28]:
with open("text.txt","w") as file: # txt yazdırdık.
    file.write(text)

In [29]:
with open('text.txt','r') as file: # txt okuyoruz.
    txt=file.read()
print(txt)

My phone number is 415-555-1212

In [30]:
output=re.search('(\d\d\d)-(\d\d\d-\d\d\d\d)',txt)

print(output.group(1))
print(output.group(2))

415
555-1212

In [31]:
value = "O 1, t 10, o 100. 100000"

In [32]:
# burada sayıları bulacağız fakat ilk değerlerini istemiyoruz onu zaten search ile yapıyorduk.
# finall ile tamamını bulacağız.
output = re.findall("\d{1}",value) # {1} tek olanları bulur.
output

['1', '1', '0', '1', '0', '0', '1', '0', '0', '0', '0', '0']

In [33]:
output = re.findall("\d{1,6}",value) # en az bir en çok 6 olanların hepsini bulur.
output

['1', '10', '100', '100000']

In [36]:
phone = "2004-959-559"

In [37]:
# metnin içisinde değişiklik yapmak istersek sub fonk. kullanırız.
output = re.sub("\D","*",phone) # \D sayı olmayanlar demek.  
output

'2004*959*559'

In [38]:
output=re.sub('\d',' + ',phone)
print(output)

 +  +  +  + - +  +  + - +  +  +

### Special Characters
___

``"[]"``	  A set of characters	``"[a-m]" ``arasındakilerden herhangi biri

``"\"``	      Signals a special sequence (can also be used to escape special characters) özel bir karakter varsa onu gösterir.

``"."``	      Any character (except newline character) . dısında herhangi birşey gelebilir.

``"^"``	      Starts with	``"^hello"`` hello ile başlasın.

``"$"``	      Ends with	``"world$"`` worl ile bitenleri bulur.

``"*"``	      Zero or more occurrences

`"+"`	      One or more occurrences, aradığın değerden bir veya daha fazla olabilir.

`"{}"`	  Exactly the specified number of occurrences 

`"|"`	      Either or	`"falls|stays"` or

`"()"`	  Capture and group
___

In [39]:
txt = "1 person against 100 people"

In [ ]:
output = re.findall("\d+")

In [40]:
output=re.findall('\d+',txt) # birden fazla rakamları aldık.
print(output)

['1', '100']

In [47]:
output=re.findall('\d*',txt) # burda zero ları yani boşları da getirdi.
print(output)

['1', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '100', '', '', '', '', '', '', '', '']

In [48]:
output=re.findall('\d',txt) 
print(output)

['1', '1', '0', '0']

In [49]:
txt = "hello world"

In [50]:
output = re.findall("^hello",txt)
output

['hello']

In [51]:
output = re.findall("^tello",txt)
output

[]

In [52]:
out = re.findall("world$", txt)
out

['world']

In [53]:
s = pd.Series(['a3', 'b4', 'c5', 'd'])

In [54]:
s.str.contains("(\d)") # str ile serilere ulaşıp contains ile test ettik.

/opt/anaconda3/lib/python3.8/site-packages/pandas/core/strings.py:1954: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

0     True
1     True
2     True
3    False
dtype: bool

In [55]:
s.apply(lambda x : True if re.search("\d", x) else False)

0     True
1     True
2     True
3    False
dtype: bool

In [56]:
s

0    a3
1    b4
2    c5
3     d
dtype: object

In [57]:
s.str.extract('(\d)') # digitsleri bulur. capture() içindekini seri içinde bulur.

     0
0    3
1    4
2    5
3  NaN

In [59]:
s.str.extract('(\w)')

   0
0  a
1  b
2  c
3  d

In [60]:
s = pd.Series(['a3aa', 'b4aa', 'c5aa'])

In [61]:
s.str.extract('(\w)')

   0
0  a
1  b
2  c

In [62]:
s.str.extract('(\w)\d(\w)(\w)') # capture etmeyeceğimiz grubu araya yazıyoruz.

   0  1  2
0  a  a  a
1  b  a  a
2  c  a  a

In [63]:
s= pd.Series(['40 l/100 km (comb)', 
        '38 l/100 km (comb)', '6.4 l/100 km (comb)',
       '8.3 kg/100 km (comb)', '5.1 kg/100 km (comb)',
       '5.4 l/100 km (comb)', '6.7 l/100 km (comb)',
       '6.2 l/100 km (comb)', '7.3 l/100 km (comb)',
       '6.3 l/100 km (comb)', '5.7 l/100 km (comb)',
       '6.1 l/100 km (comb)', '6.8 l/100 km (comb)',
       '7.5 l/100 km (comb)', '7.4 l/100 km (comb)',
       '3.6 kg/100 km (comb)', '0 l/100 km (comb)', 
       '7.8 l/100 km (comb)'])

In [64]:
s

0       40 l/100 km (comb)
1       38 l/100 km (comb)
2      6.4 l/100 km (comb)
3     8.3 kg/100 km (comb)
4     5.1 kg/100 km (comb)
5      5.4 l/100 km (comb)
6      6.7 l/100 km (comb)
7      6.2 l/100 km (comb)
8      7.3 l/100 km (comb)
9      6.3 l/100 km (comb)
10     5.7 l/100 km (comb)
11     6.1 l/100 km (comb)
12     6.8 l/100 km (comb)
13     7.5 l/100 km (comb)
14     7.4 l/100 km (comb)
15    3.6 kg/100 km (comb)
16       0 l/100 km (comb)
17     7.8 l/100 km (comb)
dtype: object

In [72]:
# sadece değerleri alırsak;
result = s.str.extract("(\d\d|\d.\d|\d)")
print(result)

      0
0    40
1    38
2   6.4
3   8.3
4   5.1
5   5.4
6   6.7
7   6.2
8   7.3
9   6.3
10  5.7
11  6.1
12  6.8
13  7.5
14  7.4
15  3.6
16    0
17  7.8

In [70]:
s.str.extract("(\d\d)")

     0
0   40
1   38
2   10
3   10
4   10
5   10
6   10
7   10
8   10
9   10
10  10
11  10
12  10
13  10
14  10
15  10
16  10
17  10

In [73]:
result=s.str.extract('(^\d*.\d*) \w*/(\d*)') 
result

      0    1
0    40  100
1    38  100
2   6.4  100
3   8.3  100
4   5.1  100
5   5.4  100
6   6.7  100
7   6.2  100
8   7.3  100
9   6.3  100
10  5.7  100
11  6.1  100
12  6.8  100
13  7.5  100
14  7.4  100
15  3.6  100
16    0  100
17  7.8  100

In [74]:
a = s.str.extract('(\S+)') # \S boşluk olmayan karakter 1 veya daha fazla olacak.
a

      0
0    40
1    38
2   6.4
3   8.3
4   5.1
5   5.4
6   6.7
7   6.2
8   7.3
9   6.3
10  5.7
11  6.1
12  6.8
13  7.5
14  7.4
15  3.6
16    0
17  7.8

In [75]:
s = pd.Series(['06/2020\n\n4.9 l/100 km (comb)',
'11/2020\n\n166 g CO2/km (comb)',                                 
'10/2019\n\n5.3 l/100 km (comb)',
'05/2022\n\n6.3 l/100 km (comb)',
'07/2019\n\n128 g CO2/km (comb)',
'06/2022\n\n112 g CO2/km (comb)',                                                 
'01/2022\n\n5.8 l/100 km (comb)',
'11/2020\n\n106 g CO2/km (comb)',
'04/2019\n\n105 g CO2/km (comb)',
'08/2020\n\n133 g CO2/km (comb)',
'04/2022\n\n133 g CO2/km (comb)'])

In [76]:
result = s.str.extract("(\d+).(\d+)")
result

     0     1
0   06  2020
1   11  2020
2   10  2019
3   05  2022
4   07  2019
5   06  2022
6   01  2022
7   11  2020
8   04  2019
9   08  2020
10  04  2022

In [77]:
t = s.str.extract('(\S+)/(\S+)')
t

     0     1
0   06  2020
1   11  2020
2   10  2019
3   05  2022
4   07  2019
5   06  2022
6   01  2022
7   11  2020
8   04  2019
9   08  2020
10  04  2022

In [78]:
result=s.str.extract('(\d{2})/(\d{4})')
result

     0     1
0   06  2020
1   11  2020
2   10  2019
3   05  2022
4   07  2019
5   06  2022
6   01  2022
7   11  2020
8   04  2019
9   08  2020
10  04  2022

In [79]:
result=s.str.extract('(\d{2}).(\d{4})')
result

     0     1
0   06  2020
1   11  2020
2   10  2019
3   05  2022
4   07  2019
5   06  2022
6   01  2022
7   11  2020
8   04  2019
9   08  2020
10  04  2022

In [80]:
result = s.str.extract("(\d{2})/(\d{4})")
result

     0     1
0   06  2020
1   11  2020
2   10  2019
3   05  2022
4   07  2019
5   06  2022
6   01  2022
7   11  2020
8   04  2019
9   08  2020
10  04  2022